MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV64GM104/mcu.h
#define _ANSELC_ANSC6_POSITION                   0x00000006
#define _ANSELC_ANSC6_MASK                       0x00000040
#define _ANSELC_ANSC6_LENGTH                     0x00000001

#define _ANSELC_ANSC7_POSITION                   0x00000007
#define _ANSELC_ANSC7_MASK                       0x00000080
#define _ANSELC_ANSC7_LENGTH                     0x00000001

#define _ANSELC_ANSC8_POSITION                   0x00000008
#define _ANSELC_ANSC8_MASK                       0x00000100
#define _ANSELC_ANSC8_LENGTH                     0x00000001

#define _ANSELC_ANSC9_POSITION                   0x00000009
#define _ANSELC_ANSC9_MASK                       0x00000200
#define _ANSELC_ANSC9_LENGTH                     0x00000001

#define _SR1C_SR1C3_POSITION                     0x00000003
#define _SR1C_SR1C3_MASK                         0x00000008
#define _SR1C_SR1C3_LENGTH                       0x00000001

#define _SR1C_SR1C6_POSITION                     0x00000006
#define _SR1C_SR1C6_MASK                         0x00000040
#define _SR1C_SR1C6_LENGTH                       0x00000001

#define _SR1C_SR1C7_POSITION                     0x00000007
#define _SR1C_SR1C7_MASK                         0x00000080
#define _SR1C_SR1C7_LENGTH                       0x00000001

#define _SR1C_SR1C8_POSITION                     0x00000008
#define _SR1C_SR1C8_MASK                         0x00000100
#define _SR1C_SR1C8_LENGTH                       0x00000001

#define _SR1C_SR1C9_POSITION                     0x00000009
#define _SR1C_SR1C9_MASK                         0x00000200
#define _SR1C_SR1C9_LENGTH                       0x00000001

#define _SR0C_SR0C3_POSITION                     0x00000003
#define _SR0C_SR0C3_MASK                         0x00000008
#define _SR0C_SR0C3_LENGTH                       0x00000001

#define _SR0C_SR0C6_POSITION                     0x00000006
#define _SR0C_SR0C6_MASK                         0x00000040
#define _SR0C_SR0C6_LENGTH                       0x00000001

#define _SR0C_SR0C7_POSITION                     0x00000007
#define _SR0C_SR0C7_MASK                         0x00000080
#define _SR0C_SR0C7_LENGTH                       0x00000001

#define _SR0C_SR0C8_POSITION                     0x00000008
#define _SR0C_SR0C8_MASK                         0x00000100
#define _SR0C_SR0C8_LENGTH                       0x00000001

#define _SR0C_SR0C9_POSITION                     0x00000009
#define _SR0C_SR0C9_MASK                         0x00000200
#define _SR0C_SR0C9_LENGTH                       0x00000001

#define _FEXU_FEXU_POSITION                      0x00000000
#define _FEXU_FEXU_MASK                          0x000000FF
#define _FEXU_FEXU_LENGTH                        0x00000008

#define _FEX2U_FEX2U_POSITION                    0x00000000
#define _FEX2U_FEX2U_MASK                        0x000000FF
#define _FEX2U_FEX2U_LENGTH                      0x00000008

#define _DPCH_DPCH_POSITION                      0x00000000
#define _DPCH_DPCH_MASK                          0x000000FF
#define _DPCH_DPCH_LENGTH                        0x00000008

#define _APPS_APIFUL_POSITION                    0x00000000
#define _APPS_APIFUL_MASK                        0x00000001
#define _APPS_APIFUL_LENGTH                      0x00000001

#define _APPS_APIOV_POSITION                     0x00000001
#define _APPS_APIOV_MASK                         0x00000002
#define _APPS_APIOV_LENGTH                       0x00000001

#define _APPS_APOFUL_POSITION                    0x00000002
#define _APPS_APOFUL_MASK                        0x00000004
#define _APPS_APOFUL_LENGTH                      0x00000001

#define _APPS_APOOV_POSITION                     0x00000003
#define _APPS_APOOV_MASK                         0x00000008
#define _APPS_APOOV_LENGTH                       0x00000001

#define _APPS_STRFUL_POSITION                    0x00000004
#define _APPS_STRFUL_MASK                        0x00000010
#define _APPS_STRFUL_LENGTH                      0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register FSEC (0xab80)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSEC;
#define _FSEC(x) __attribute__((address(0xab80),deprecated_definition("consider migrating to #pragma config"),section("__FSEC.sec"),space(prog))) __prog__ uint16_t _FSEC = (x);

/*
** Only one invocation of FSEC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSEC.
** Multiple options may be combined, as shown:
**
** _FSEC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write-Protect Bit:
**     BWRP_ON              Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**
**   Boot Segment Code-Protect Level bits:
**     BSS_HIGH             High Security
**     BSS_STNDRD           Standard Security
**     BSS_DISABLED         No Protection (other than BWRP)
**
**   Boot Segment Control Bit:
**     BSS2_ON              Boot Segment size determined by FBSLIM
**     BSS2_OFF             No Boot Segment
**
**   General Segment Write-Protect Bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect Level bits:
**     GSS_HIGH             High Security
**     GSS_STNDRD           Standard Security
**     GSS_DISABLED         No Protection (other than GWRP)
**
**   Configuration Segment Write-Protect Bit:
**     CWRP_ON              Configuration Segment is write protected
**     CWRP_OFF             Configuration Segment may be written
**
**   Configuration Segment Code-Protect Level bits:
**     CSS_HIGH             High Security
**     CSS_ENHNCD           Enhanced Security
**     CSS_STNDRD           Standard Security
**     CSS_DISABLED         No Protection (other than CWRP)
**
**   Alternate Interrupt Vector Table Disable Bit :
**     AIVTDIS_ENABLE       Enable Alternate Vector Table
**     AIVTDIS_DISABLE      Disable Alternate Vector Table
**
*/

#define BWRP_ON              0x8FEE
#define BWRP_OFF             0x8FEF

