MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV64GM104/mcu.h
#define ALTI2C1_ON           0x0005
#define ALTI2C1_OFF          0x000D

/* Register FALTREG (0xabc4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FALTREG;
#define _FALTREG(x) __attribute__((address(0xabc4),deprecated_definition("consider migrating to #pragma config"),section("__FALTREG.sec"),space(prog))) __prog__ uint16_t _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Interrupt Priority Level (IPL) Selection Bits For Alternate Working Register Set 1:
**     CTXT1_IPL1           Alternate register set 1 assigned to IPL level 1
**     CTXT1_IPL2           Alternate register set 1 assigned to IPL level 2
**     CTXT1_IPL3           Alternate register set 1 assigned to IPL level 3
**     CTXT1_IPL4           Alternate register set 1 assigned to IPL level 4
**     CTXT1_IPL5           Alternate register set 1 assigned to IPL level 5
**     CTXT1_IPL6           Alternate register set 1 assigned to IPL level 6
**     CTXT1_IPL7           Alternate register set 1 assigned to IPL level 7
**     CTXT1_NONE           Not Assigned
**
**   Interrupt Priority Level (IPL) Selection Bits For Alternate Working Register Set 2:
**     CTXT2_IPL1           Alternate register set 2  assigned to IPL level 1
**     CTXT2_IPL2           Alternate register set 2  assigned to IPL level 2
**     CTXT2_IPL3           Alternate register set 2  assigned to IPL level 3
**     CTXT2_IPL4           Alternate register set 2  assigned to IPL level 4
**     CTXT2_IPL5           Alternate register set 2  assigned to IPL level 5
**     CTXT2_IPL6           Alternate register set 2  assigned to IPL level 6
**     CTXT2_IPL7           Alternate register set 2 assigned to IPL level 7
**     CTXT2_NONE           Not Assigned
**
*/

#define CTXT1_IPL1           0x0070
#define CTXT1_IPL2           0x0071
#define CTXT1_IPL3           0x0072
#define CTXT1_IPL4           0x0073
#define CTXT1_IPL5           0x0074
#define CTXT1_IPL6           0x0075
#define CTXT1_IPL7           0x0076
#define CTXT1_NONE           0x0077

#define CTXT2_IPL1           0x0007
#define CTXT2_IPL2           0x0017
#define CTXT2_IPL3           0x0027
#define CTXT2_IPL4           0x0037
#define CTXT2_IPL5           0x0047
#define CTXT2_IPL6           0x0057
#define CTXT2_IPL7           0x0067
#define CTXT2_NONE           0x0077



/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x200

#undef _FLASH_ROW
#define _FLASH_ROW 0x40

/*
 * Memory Segments Sizes
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0xa980

#define __FSEC_BASE 0xab80
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0xab90
#define __FBSLIM_LENGTH 0x2

#define __FOSCSEL_BASE 0xab98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xab9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xaba0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xaba4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xaba8
#define __FICD_LENGTH 0x2

#define __FDMTINTVL_BASE 0xabac
#define __FDMTINTVL_LENGTH 0x2

#define __FDMTINTVH_BASE 0xabb0
#define __FDMTINTVH_LENGTH 0x2

#define __FDMTCNTL_BASE 0xabb4
#define __FDMTCNTL_LENGTH 0x2

#define __FDMTCNTH_BASE 0xabb8
#define __FDMTCNTH_LENGTH 0x2

#define __FDMT_BASE 0xabbc
#define __FDMT_LENGTH 0x2

#define __FDEVOPT_BASE 0xabc0
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0xabc4
#define __FALTREG_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U2TX 3
#define _RPOUT_SDO2 8
#define _RPOUT_SCK2OUT 9
#define _RPOUT_SS2OUT 10
#define _RPOUT_C1TX 14
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_C1OUT 24
#define _RPOUT_C2OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_SYNCO1 45
#define _RPOUT_REFCLK 49
#define _RPOUT_C4OUT 50
#define _RPOUT_C5OUT 51
#define _RPOUT_SENT1 57
#define _RPOUT_SENT2 58

#endif
